Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: There are some incompatibilities in the Python LDAP 3.1.0 module, which might prevent you from using that version. If you get error `AttributeError: 'module' object has no attribute '_trace_level' <https://github.com/python-ldap/python-ldap/issues/226>`_, downgrading python-ldap to 3.0.0 might help.
sv: Det finns vissa inkompatibiliteter i Python LDAP 3.1.0-modulen, vilket kan hindra dig frÃ¥n att anvÃ¤nda den versionen. Om du fÃ¥r felmeddelandet `AttributeError: 'module' object has no attribute '_trace_level' <https://github.com/python-ldap/python-ldap/issues/226>`_ kan det hjÃ¤lpa att nedgradera python-ldap till 3.0.0.

source: Once you have the package installed, you can hook it into the Django authentication:
sv: NÃ¤r du har installerat paketet kan du koppla det till Djangos autentisering:

source: You should remove ``'social_core.backends.email.EmailAuth'`` from the :setting:`django:AUTHENTICATION_BACKENDS` setting, otherwise users will be able to set their password in Weblate, and authenticate using that. Keeping ``'weblate.accounts.auth.WeblateUserBackend'`` is still needed in order to make permissions and facilitate anonymous users. It will also allow you to sign in using a local admin account, if you have created it (e.g. by using :wladmin:`createadmin`).
sv: Du bÃ¶r ta bort ``'social_core.backends.email.EmailAuth'`` frÃ¥n instÃ¤llningen :setting:`django:AUTHENTICATION_BACKENDS`, annars kommer anvÃ¤ndare att kunna stÃ¤lla in sitt lÃ¶senord i Weblate och autentisera sig med det. Det Ã¤r fortfarande nÃ¶dvÃ¤ndigt att behÃ¥lla ``'weblate.accounts.auth.WeblateUserBackend'`` fÃ¶r att skapa behÃ¶righeter och underlÃ¤tta fÃ¶r anonyma anvÃ¤ndare. Det gÃ¶r det ocksÃ¥ mÃ¶jligt att logga in med ett lokalt administratÃ¶rskonto, om du har skapat ett sÃ¥dant (t.ex. med :wladmin:`createadmin`).

source: Using bind password
sv: AnvÃ¤nda bindlÃ¶senord

source: If you can not use direct bind for authentication, you will need to use search, and provide a user to bind for the search. For example:
sv: Om du inte kan anvÃ¤nda direktbindning fÃ¶r autentisering mÃ¥ste du anvÃ¤nda sÃ¶kning och ange en anvÃ¤ndare att binda fÃ¶r sÃ¶kningen. Till exempel:

source: CAS authentication
sv: Autentisering med CAS

source: CAS authentication can be achieved using a package such as `Django CAS NG`_.
sv: CAS-autentisering kan uppnÃ¥s med hjÃ¤lp av ett paket som `Django CAS NG`_.

source: Step one is disclosing the e-mail field of the user via CAS. This has to be configured on the CAS server itself, and requires you run at least CAS v2 since CAS v1 doesn't support attributes at all.
sv: Steg ett Ã¤r att avslÃ¶ja anvÃ¤ndarens e-postfÃ¤lt via CAS. Detta mÃ¥ste konfigureras pÃ¥ sjÃ¤lva CAS-servern och krÃ¤ver att du kÃ¶r minst CAS v2, eftersom CAS v1 inte stÃ¶der attribut alls.

source: Step two is updating Weblate to use your CAS server and attributes.
sv: Steg tvÃ¥ Ã¤r att uppdatera Weblate sÃ¥ att den anvÃ¤nder din CAS-server och dina attribut.

source: To install `Django CAS NG`_:
sv: FÃ¶r att installera `Django CAS NG`_:

source: Once you have the package installed you can hook it up to the Django authentication system by modifying the :file:`settings.py` file:
sv: NÃ¤r du har installerat paketet kan du koppla det till Djangos autentiseringssystem genom att Ã¤ndra filen :file:`settings.py`:

source: Finally, a signal can be used to map the e-mail field to the user object. For this to work you have to import the signal from the `django-cas-ng` package and connect your code with this signal. Doing this in settings file can cause problems, therefore it's suggested to put it:
sv: Slutligen kan en signal anvÃ¤ndas fÃ¶r att mappa e-postfÃ¤ltet till anvÃ¤ndarobjektet. FÃ¶r att detta ska fungera mÃ¥ste du importera signalen frÃ¥n paketet `django-cas-ng` och koppla din kod till denna signal. Att gÃ¶ra detta i instÃ¤llningsfilen kan orsaka problem, dÃ¤rfÃ¶r rekommenderas det att placera den:

source: In your app config's :py:meth:`django:django.apps.AppConfig.ready` method
sv: I din appkonfigurations :py:meth:`django:django.apps.AppConfig.ready`-metod

source: In the project's :file:`urls.py` file (when no models exist)
sv: I projektets :file:`urls.py`-fil (nÃ¤r inga modeller finns)

source: Configuring third party Django authentication
sv: Konfigurera tredjeparts Django-autentisering

source: Generally any Django authentication plugin should work with Weblate. Just follow the instructions for the plugin, just remember to keep the Weblate user backend installed.
sv: I allmÃ¤nhet bÃ¶r alla Django-autentiseringsplugins fungera med Weblate. FÃ¶lj bara instruktionerna fÃ¶r pluginen och kom ihÃ¥g att behÃ¥lla Weblate-anvÃ¤ndarbackend installerad.

source: Typically the installation will consist of adding an authentication backend to :setting:`django:AUTHENTICATION_BACKENDS` and installing an authentication app (if there is any) into :setting:`django:INSTALLED_APPS`:
sv: Vanligtvis bestÃ¥r installationen av att lÃ¤gga till en autentiseringsbackend till :setting:`django:AUTHENTICATION_BACKENDS` och installera en autentiseringsapp (om det finns nÃ¥gon) i :setting:`django:INSTALLED_APPS`:

source: Weblate supports the following second factors:
sv: Weblate stÃ¶der fÃ¶ljande andra faktorer:

source: Both, Passkeys and security keys are supported.
sv: BÃ¥de passnycklar och sÃ¤kerhetsnycklar stÃ¶ds.

source: Passkeys validate your identity using touch, facial recognition, a device password, or a PIN as they include user verification.
sv: Passkeys validerar din identitet med hjÃ¤lp av touch, ansiktsigenkÃ¤nning, ett enhetslÃ¶senord eller en PIN-kod, eftersom de inkluderar anvÃ¤ndarverifiering.

source: Security keys are WebAuthn credentials that can only be used as a second factor of authentication, and these only validate user presence.
sv: SÃ¤kerhetsnycklar Ã¤r WebAuthn-autentiseringsuppgifter som endast kan anvÃ¤ndas som en andra autentiseringsfaktor, och dessa validerar endast anvÃ¤ndarens nÃ¤rvaro.

source: Authenticator apps and browser extensions like Aegis, Bitwarden, Google Authenticator, 1Password, Authy, Microsoft Authenticator, etc. generate time-based one-time passwords that are used as a second factor to verify your identity when prompted during sign-in.
sv: Autentiseringsappar och webblÃ¤sartillÃ¤gg som Aegis, Bitwarden, Google Authenticator, 1Password, Authy, Microsoft Authenticator etc. genererar tidsbaserade engÃ¥ngslÃ¶senord som anvÃ¤nds som en andra faktor fÃ¶r att verifiera din identitet nÃ¤r du ombeds gÃ¶ra det vid inloggningen.

source: Keep your recovery codes as safe as your password. We recommend saving them with a password manager such as Bitwarden, 1Password, Authy, or Keeper.
sv: FÃ¶rvara dina Ã¥terstÃ¤llningskoder lika sÃ¤kert som ditt lÃ¶senord. Vi rekommenderar att du sparar dem med en lÃ¶senordshanterare som Bitwarden, 1Password, Authy eller Keeper.

source: Each user can configure this in :ref:`profile-account` and second factor will be required to sign in addition to the existing authentication method.
sv: Varje anvÃ¤ndare kan konfigurera detta i :ref:`profile-account` och en andra faktor kommer att krÃ¤vas fÃ¶r inloggning utÃ¶ver den befintliga autentiseringsmetoden.

source: This can be enforced for users at the project (see :ref:`project-enforced_2fa`) or team level.
sv: Detta kan tillÃ¤mpas fÃ¶r anvÃ¤ndare pÃ¥ projektnivÃ¥ (se :ref:`project-enforced_2fa`) eller teamnivÃ¥.

source: The permissions of a team with enforced two-factor authentication won't be applied to users who do not have it configured.
sv: BehÃ¶righeterna fÃ¶r ett team med tvingande tvÃ¥faktorsautentisering kommer inte att tillÃ¤mpas pÃ¥ anvÃ¤ndare som inte har den konfigurerad.

source: Backing up and moving Weblate
sv: SÃ¤kerhetskopiera och flytta Weblate

source: Project level backups
sv: SÃ¤kerhetskopior pÃ¥ projektnivÃ¥

source: Restoring backups is only supported when using PostgreSQL or MariaDB 10.5+ as a database.
sv: Ã terstÃ¤llning av sÃ¤kerhetskopior stÃ¶ds endast nÃ¤r PostgreSQL eller MariaDB 10.5+ anvÃ¤nds som databas.

source: The project backups all translation content from Weblate (project, components, translations, string comments, suggestions or checks). It is suitable for transferring a project to another Weblate instance.
sv: Projektet sÃ¤kerhetskopierar allt Ã¶versÃ¤ttningsinnehÃ¥ll frÃ¥n Weblate (projekt, komponenter, Ã¶versÃ¤ttningar, strÃ¤ngkommentarer, fÃ¶rslag eller kontroller). Det Ã¤r lÃ¤mpligt fÃ¶r att Ã¶verfÃ¶ra ett projekt till en annan Weblate-instans.

source: You can perform a project backup in :guilabel:`Operations` â :guilabel:`Backups`. The backup can be restored when creating a project (see :ref:`adding-projects`).
sv: Du kan gÃ¶ra en sÃ¤kerhetskopia av projektet i :guilabel:`Operations` â :guilabel:`Backups`. SÃ¤kerhetskopian kan Ã¥terstÃ¤llas nÃ¤r du skapar ett projekt (se :ref:`adding-projects`).

source: The backups currently do not include access control information and history.
sv: SÃ¤kerhetskopiorna innehÃ¥ller fÃ¶r nÃ¤rvarande inte information om Ã¥tkomstkontroll och historik.

source: The comments and suggestions are backed up with an username of user who did create them. Upon import it is assigned to a matching user. If there is no user with such username, it is assigned to anonymous user.
sv: Kommentarerna och fÃ¶rslagen backas upp med ett anvÃ¤ndarnamn fÃ¶r den anvÃ¤ndare som skapade dem. Vid import tilldelas de en matchande anvÃ¤ndare. Om det inte finns nÃ¥gon anvÃ¤ndare med det anvÃ¤ndarnamnet tilldelas de en anonym anvÃ¤ndare.

source: The generated backups are kept on the server as configured by :setting:`PROJECT_BACKUP_KEEP_DAYS` and :setting:`PROJECT_BACKUP_KEEP_COUNT` (it defaults to keep at most 3 backups for 30 days).
sv: De genererade sÃ¤kerhetskopiorna sparas pÃ¥ servern enligt konfigurationen i :setting:`PROJECT_BACKUP_KEEP_DAYS` och :setting:`PROJECT_BACKUP_KEEP_COUNT` (standardinstÃ¤llningen Ã¤r att spara hÃ¶gst 3 sÃ¤kerhetskopior i 30 dagar).

source: Use the generated file to import project when :ref:`adding-projects` or in :wladmin:`import_projectbackup`.
sv: AnvÃ¤nd den genererade filen fÃ¶r att importera projektet nÃ¤r du :ref:`adding-projects` eller i :wladmin:`import_projectbackup`.

source: Restoring of the backup might fail if the restoring server has different set of :ref:`languages` or different configuration of :setting:`SIMPLIFY_LANGUAGES`. The restore will tell you which language codes could not be processed and you can then add missing language definitions manually.
sv: Ã terstÃ¤llningen av sÃ¤kerhetskopian kan misslyckas om Ã¥terstÃ¤llningsservern har en annan uppsÃ¤ttning :ref:`languages` eller en annan konfiguration av :setting:`SIMPLIFY_LANGUAGES`. Ã terstÃ¤llningen kommer att visa vilka sprÃ¥kkoder som inte kunde bearbetas och du kan sedan lÃ¤gga till saknade sprÃ¥kdefinitioner manuellt.

source: Automated backup using BorgBackup
sv: Automatisk sÃ¤kerhetskopiering med BorgBackup

source: Weblate has built-in support for creating service backups using `BorgBackup`_. Borg creates space-effective encrypted backups which can be safely stored in the cloud. The backups can be controlled in the management interface from the :guilabel:`Backups` tab.
sv: Weblate har inbyggt stÃ¶d fÃ¶r att skapa sÃ¤kerhetskopior av tjÃ¤nsten med hjÃ¤lp av `BorgBackup`_. Borg skapar utrymmeseffektiva krypterade sÃ¤kerhetskopior som kan lagras sÃ¤kert i molnet. SÃ¤kerhetskopiorna kan kontrolleras i administrationsgrÃ¤nssnittet frÃ¥n fliken :guilabel:`Backups`.

source: Both PostgreSQL and MySQL/MariaDB databases are included in the automated backups.
sv: BÃ¥de PostgreSQL- och MySQL/MariaDB-databaser ingÃ¥r i de automatiska sÃ¤kerhetskopiorna.

source: The backups using Borg are incremental and Weblate is configured to keep following backups:
sv: SÃ¤kerhetskopiorna med Borg Ã¤r inkrementella och Weblate Ã¤r konfigurerat fÃ¶r att behÃ¥lla fÃ¶ljande sÃ¤kerhetskopior:

source: Daily backups for 14 days back
sv: Dagliga sÃ¤kerhetskopior i 14 dagar tillbaka

source: Weekly backups for 8 weeks back
sv: Veckobackuper fÃ¶r 8 veckor tillbaka

source: Monthly backups for 6 months back
sv: MÃ¥natliga sÃ¤kerhetskopior fÃ¶r 6 mÃ¥nader tillbaka

source: Borg encryption key
sv: Borg-krypteringsnyckel

source: `BorgBackup`_ creates encrypted backups and you wouldnât be able to restore them without the passphrase. The passphrase is generated when adding a new backup service and you should copy it and keep it in a secure place.
sv: `BorgBackup`_ skapar krypterade sÃ¤kerhetskopior och du kan inte Ã¥terstÃ¤lla dem utan lÃ¶senordet. LÃ¶senordet genereras nÃ¤r du lÃ¤gger till en ny sÃ¤kerhetskopieringstjÃ¤nst och du bÃ¶r kopiera det och fÃ¶rvara det pÃ¥ ett sÃ¤kert stÃ¤lle.

source: If you are using :ref:`cloudbackup`, please backup your private SSH key too, as itâs used to access your backups.
sv: Om du anvÃ¤nder :ref:`cloudbackup`, vÃ¤nligen sÃ¤kerhetskopiera Ã¤ven din privata SSH-nyckel, eftersom den anvÃ¤nds fÃ¶r att komma Ã¥t dina sÃ¤kerhetskopior.

source: Customizing backup
sv: Anpassa sÃ¤kerhetskopiering

source: The database backup can be configured via :setting:`DATABASE_BACKUP`.
sv: Databasbackupen kan konfigureras via :setting:`DATABASE_BACKUP`.

source: The backup creation can be customized using :setting:`BORG_EXTRA_ARGS`.
sv: SÃ¤kerhetskopieringen kan anpassas med hjÃ¤lp av :setting:`BORG_EXTRA_ARGS`.

source: Weblate provisioned backup storage
sv: Weblate tillhandahÃ¶ll backup-lagring

source: The easiest way of backing up your Weblate instance is purchasing the `backup service at weblate.org <https://weblate.org/support/#backup>`_. This is how you get it running:
sv: Det enklaste sÃ¤ttet att sÃ¤kerhetskopiera din Weblate-instans Ã¤r att kÃ¶pa `sÃ¤kerhetskopieringstjÃ¤nsten pÃ¥ weblate.org <https://weblate.org/support/#backup>`_. SÃ¥ hÃ¤r fÃ¥r du igÃ¥ng den:

source: Purchase the `Backup service` on https://weblate.org/support/#backup.
sv: KÃ¶p tjÃ¤nsten "Backup service" pÃ¥ https://weblate.org/support/#backup.

source: Enter the obtained key in the management interface, see :ref:`activate-support`.
sv: Ange den erhÃ¥llna nyckeln i hanteringsgrÃ¤nssnittet, se :ref:`activate-support`.

source: Weblate connects to the cloud service and obtains access info for the backups.
sv: Weblate ansluter till molntjÃ¤nsten och hÃ¤mtar Ã¥tkomstinformation fÃ¶r sÃ¤kerhetskopiorna.

source: Turn on the new backup configuration from the :guilabel:`Backups` tab.
sv: Aktivera den nya sÃ¤kerhetskopieringskonfigurationen frÃ¥n fliken :guilabel:`Backups`.

source: Backup your Borg credentials to be able to restore the backups, see :ref:`borg-keys`.
sv: SÃ¤kerhetskopiera dina Borg-inloggningsuppgifter sÃ¥ att du kan Ã¥terstÃ¤lla sÃ¤kerhetskopiorna, se :ref:`borg-keys`.

source: The manual step of turning everything on is there for your safety. Without your consent no data is sent to the backup repository obtained through the registration process.
sv: Det manuella steget att slÃ¥ pÃ¥ allt finns dÃ¤r fÃ¶r din sÃ¤kerhet. Utan ditt samtycke skickas inga data till det backup-arkiv som erhÃ¥llits genom registreringsprocessen.

source: Using custom backup storage
sv: AnvÃ¤nda anpassad sÃ¤kerhetskopieringslagring

source: You can also use your own storage for the backups. SSH can be used to store backups in the remote destination, the target server needs to have `BorgBackup`_ installed.
sv: Du kan ocksÃ¥ anvÃ¤nda din egen lagringsplats fÃ¶r sÃ¤kerhetskopiorna. SSH kan anvÃ¤ndas fÃ¶r att lagra sÃ¤kerhetskopior pÃ¥ den fjÃ¤rranslutna destinationen, men mÃ¥lservrarna mÃ¥ste ha `BorgBackup`_ installerat.

source: :doc:`borg:usage/general` in the Borg documentation
sv: :doc:`borg:usage/general` i Borg-dokumentationen

source: Local filesystem
sv: Lokalt filsystem

source: It is recommended to specify the absolute path for the local backup, for example `/path/to/backup`. The directory has to be writable by the user running Weblate (see :ref:`file-permissions`). If it doesn't exist, Weblate attempts to create it but needs the appropriate permissions to do so.
sv: Det rekommenderas att ange den absoluta sÃ¶kvÃ¤gen fÃ¶r den lokala sÃ¤kerhetskopian, till exempel `/path/to/backup`. Katalogen mÃ¥ste vara skrivbar fÃ¶r den anvÃ¤ndare som kÃ¶r Weblate (se :ref:`file-permissions`). Om den inte finns fÃ¶rsÃ¶ker Weblate skapa den, men behÃ¶ver rÃ¤tt behÃ¶righet fÃ¶r att gÃ¶ra det.

source: When running Weblate in Docker, please ensure the backup location is exposed as a volume from the Weblate container. Otherwise the backups will be discarded by Docker upon restarting the container it is in.
sv: NÃ¤r du kÃ¶r Weblate i Docker, se till att sÃ¤kerhetskopieringsplatsen Ã¤r exponerad som en volym frÃ¥n Weblate-containern. Annars kommer sÃ¤kerhetskopiorna att kasseras av Docker nÃ¤r containern startas om.

source: One option is to place backups into an existing volume, for example :file:`/app/data/borgbackup`. This is an existing volume in the container.
sv: Ett alternativ Ã¤r att placera sÃ¤kerhetskopior i en befintlig volym, till exempel :file:`/app/data/borgbackup`. Detta Ã¤r en befintlig volym i containern.

source: You can also add a new container for the backups in the Docker Compose file for example by using :file:`/borgbackup`:
sv: Du kan ocksÃ¥ lÃ¤gga till en ny behÃ¥llare fÃ¶r sÃ¤kerhetskopiorna i Docker Compose-filen, till exempel genom att anvÃ¤nda :file:`/borgbackup`:

source: The directory where backups will be stored have to be owned by UID 1000, otherwise Weblate wonât be able to write the backups there.
sv: Katalogen dÃ¤r sÃ¤kerhetskopiorna ska lagras mÃ¥ste Ã¤gas av UID 1000, annars kan Weblate inte skriva sÃ¤kerhetskopiorna dÃ¤r.

source: Remote backups
sv: FjÃ¤rrbackuper

source: For creating remote backups, you will have to install `BorgBackup`_ onto another server thatâs accessible for your Weblate deployment via SSH using the Weblate SSH key:
sv: FÃ¶r att skapa fjÃ¤rrbackuper mÃ¥ste du installera `BorgBackup`_ pÃ¥ en annan server som Ã¤r tillgÃ¤nglig fÃ¶r din Weblate-distribution via SSH med hjÃ¤lp av Weblate SSH-nyckeln:

source: Prepare a server where your backups will be stored.
sv: FÃ¶rbered en server dÃ¤r dina sÃ¤kerhetskopior ska lagras.

source: Install the SSH server on it (you will get it by default with most Linux distributions).
sv: Installera SSH-servern pÃ¥ den (den ingÃ¥r som standard i de flesta Linux-distributioner).

source: Install `BorgBackup`_ on that server; most Linux distributions have packages available (see :doc:`borg:installation`).
sv: Installera `BorgBackup`_ pÃ¥ den servern; de flesta Linux-distributioner har paket tillgÃ¤ngliga (se :doc:`borg:installation`).

source: Choose an existing user or create a new user that will be used for backing up.
sv: VÃ¤lj en befintlig anvÃ¤ndare eller skapa en ny anvÃ¤ndare som ska anvÃ¤ndas fÃ¶r sÃ¤kerhetskopiering.

source: Add Weblate SSH key to the user's `.ssh/authorized_keys` file, so that Weblate can SSH to the server without a password (see :ref:`weblate-ssh-key`).
sv: LÃ¤gg till Weblate SSH-nyckel till anvÃ¤ndarens `.ssh/authorized_keys`-fil, sÃ¥ att Weblate kan ansluta till servern via SSH utan lÃ¶senord (se :ref:`weblate-ssh-key`).

source: Create a user-writable directory where Weblate can remotely set up the Borg backup repository, for example in the home directory (i.e. ``/home/borg/backups``).
sv: Skapa en katalog som anvÃ¤ndaren kan skriva i, dÃ¤r Weblate kan fjÃ¤rrkonfigurera Borg-sÃ¤kerhetskopieringsarkivet, till exempel i hemkatalogen (dvs. ``/home/borg/backups``).

source: Configure the backup location in Weblate as ``user@host:/home/borg/backups`` or ``ssh://user@host:port/home/borg/backups``.
sv: Konfigurera sÃ¤kerhetskopieringsplatsen i Weblate som ``user@host:/home/borg/backups`` eller ``ssh://user@host:port/home/borg/backups``.

source: Once enabled, the backups will be triggered automatically daily. You can also manually trigger a backup from the Weblate UI.
sv: NÃ¤r funktionen Ã¤r aktiverad kommer sÃ¤kerhetskopieringen att startas automatiskt varje dag. Du kan ocksÃ¥ starta en sÃ¤kerhetskopiering manuellt frÃ¥n Weblate-grÃ¤nssnittet.

source: :ref:`cloudbackup` provides you automated remote backups without any effort.
sv: :ref:`cloudbackup` ger dig automatiska fjÃ¤rrbackuper utan nÃ¥gon anstrÃ¤ngning.

source: Restoring from BorgBackup
sv: Ã terstÃ¤llning frÃ¥n BorgBackup

source: Restore access to your backup repository and prepare your backup passphrase.
sv: Ã terstÃ¤ll Ã¥tkomsten till ditt sÃ¤kerhetskopieringsarkiv och fÃ¶rbered din sÃ¤kerhetskopieringslÃ¶senord.

source: List all the backups on the server using ``borg list REPOSITORY``.
sv: Lista alla sÃ¤kerhetskopior pÃ¥ servern med ``borg list REPOSITORY``.

source: Restore the desired backup to the current directory using ``borg extract REPOSITORY::ARCHIVE``.
sv: Ã terstÃ¤ll Ã¶nskad sÃ¤kerhetskopia till den aktuella katalogen med hjÃ¤lp av ``borg extract REPOSITORY::ARCHIVE``.

source: Restore the database from the SQL dump placed in the ``backup`` directory in the Weblate data dir (see :ref:`backup-dumps`).
sv: Ã terstÃ¤ll databasen frÃ¥n SQL-dumpen som finns i katalogen ``backup`` i Weblate-datakatalogen (se :ref:`backup-dumps`).

source: Copy the Weblate configuration (:file:`backups/settings.py`, see :ref:`backup-dumps`) to the correct location, see :ref:`configuration`.
sv: Kopiera Weblate-konfigurationen (:file:`backups/settings.py`, se :ref:`backup-dumps`) till rÃ¤tt plats, se :ref:`configuration`.

source: When using Docker container, the settings file is already included in the container and you should restore the original environment variables. The :file:`environment.yml` file might help you with this (see :ref:`backup-dumps`).
sv: NÃ¤r du anvÃ¤nder Docker-containern ingÃ¥r instÃ¤llningsfilen redan i containern och du bÃ¶r Ã¥terstÃ¤lla de ursprungliga miljÃ¶variablerna. Filen :file:`environment.yml` kan hjÃ¤lpa dig med detta (se :ref:`backup-dumps`).

source: Copy the whole restored data dir to the location configured by :setting:`DATA_DIR`.
sv: Kopiera hela den Ã¥terstÃ¤llda datakatalogen till den plats som konfigurerats av :setting:`DATA_DIR`.

source: When using Docker container place the data into the data volume, see :ref:`docker-volume`.
sv: NÃ¤r du anvÃ¤nder Docker-container placerar du data i datavolymen, se :ref:`docker-volume`.

source: Please ensure the files have correct ownership and permissions, see :ref:`file-permissions`.
sv: Se till att filerna har rÃ¤tt Ã¤garskap och behÃ¶righeter, se :ref:`file-permissions`.

source: The Borg session might look like this:
sv: Borg-sessionen kan se ut sÃ¥ hÃ¤r:

source: Manual backup
sv: Manuell sÃ¤kerhetskopiering

source: Depending on what you want to save, back up the type of data Weblate stores in each respective place.
sv: Beroende pÃ¥ vad du vill spara, sÃ¤kerhetskopiera den typ av data som Weblate lagrar pÃ¥ respektive plats.

source: If you are doing the manual backups, you might want to silence Weblate's warning about a lack of backups by adding ``weblate.I028`` to :setting:`django:SILENCED_SYSTEM_CHECKS` in :file:`settings.py` or :envvar:`WEBLATE_SILENCED_SYSTEM_CHECKS` for Docker.
sv: Om du gÃ¶r manuella sÃ¤kerhetskopior kan du stÃ¤nga av Weblates varning om bristande sÃ¤kerhetskopior genom att lÃ¤gga till ``weblate.I028`` till :setting:`django:SILENCED_SYSTEM_CHECKS` i :file:`settings.py` eller :envvar:`WEBLATE_SILENCED_SYSTEM_CHECKS` fÃ¶r Docker.

source: The actual storage location depends on your database setup.
sv: Den faktiska lagringsplatsen beror pÃ¥ din databasinstÃ¤llning.

source: The database is the most important storage. Set up regular backups of your database. Without the database, all the translations are gone.
sv: Databasen Ã¤r den viktigaste lagringsplatsen. StÃ¤ll in regelbundna sÃ¤kerhetskopieringar av din databas. Utan databasen fÃ¶rsvinner alla Ã¶versÃ¤ttningar.
